Diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Список</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ссылка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СоздатьАкты(Команда)
	ДлительнаяОперация = СоздатьАктыНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ТекстСообщения = "Формирование актов...";
	Оповещение = Новый ОписаниеОповещения("ОперацияВФонеЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
КонецПроцедуры

&НаСервере
Функция СоздатьАктыНаСервере()
	
	НаименованиеЗадания = НСтр("ru =  'Формирование актов'");
	ИмяФункции = "Обработки.ВКМ_МассовоеСозданиеАктов.СозданныеАкты";
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Период", Объект.Период);
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = ИмяФункции;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор);
	//ИмяФункции1 = Обработки.ВКМ_МассовоеСозданиеАктов.СозданныеАкты(ПараметрыПроцедуры);
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, ИмяФункции, ПараметрыПроцедуры);
	
КонецФункции

&НаКлиенте
Процедура ОперацияВФонеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаДокумент = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Если Результат.Статус = "Выполнено" И СсылкаНаДокумент.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нет данных для создания документов";
		Сообщение.Сообщить();	
	ИначеЕсли Результат.Статус = "Выполнено" И СсылкаНаДокумент.Количество() > 0 Тогда
		ДополнительныеОперацииЗавершениеНаСервере(Результат.АдресРезультата);
		ОбщегоНазначенияКлиент.СообщитьПользователю("Формирование документов реализации выполнено успешно");
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Статус операции: ошибка выполнения, обратитесь к системному администратору");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОперацииЗавершениеНаСервере(АдресХранилища)
	Результат = ПолучитьИзВременногоХранилища(АдресХранилища);
	СсылкаНаДокумент = Результат;
	
	Объект.Список.Очистить();
	
	Для Каждого Строка Из СсылкаНаДокумент Цикл
		НоваяСтрока = Объект.Список.Добавить();
		НоваяСтрока.Договор = Строка.Договор;
		НоваяСтрока.Ссылка = Строка.Ссылка;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
